tap "buo/cask-upgrade"
tap "cloudflare/cloudflare"
tap "derailed/k9s"
tap "espanso/espanso"
tap "fluxcd/tap"
tap "gocardless/taps"
tap "gromgit/fuse"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "hookdeck/hookdeck"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "oven-sh/bun"
tap "puma/puma"
tap "qmk/qmk"
tap "stripe/stripe-cli"
tap "supabase/tap"
tap "twilio/brew"
brew "act"
brew "antigen"
brew "zstd"
brew "jpeg-xl"
brew "openssl@3"
brew "ncurses"
brew "readline"
brew "cmake"
brew "coreutils"
brew "krb5"
brew "deno"
brew "direnv"
brew "docker"
brew "exercism"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "harfbuzz"
brew "sdl2"
brew "tesseract"
brew "ffmpeg"
brew "flyctl"
brew "fzf"
brew "gcc"
brew "gh"
brew "ghostscript"
brew "git-absorb"
brew "git-delta"
brew "git-lfs"
brew "gnu-getopt"
brew "gnupg"
brew "protobuf"
brew "gnuplot"
brew "gpgme"
brew "pkgconf"
brew "guile"
brew "hopenpgp-tools"
brew "htop"
brew "jq"
brew "kind"
brew "lefthook"
brew "libffi"
brew "libheif"
brew "llvm@17"
brew "macos-trash", link: true
brew "mas"
brew "meilisearch"
brew "mosh"
brew "mysql-client"
brew "mysql-client@8.4"
brew "mysql@8.0"
brew "utf8proc"
brew "neovim"
brew "node"
brew "openjdk"
brew "openjdk@11"
brew "opentofu"
brew "pam-reattach"
brew "php"
brew "pillow"
brew "pinentry-mac"
brew "pipenv"
brew "poppler"
brew "postgresql@14"
brew "python@3.10"
brew "ruby-build"
brew "rbenv"
brew "rclone"
brew "ripgrep"
brew "rust"
brew "rustup"
brew "sccache"
brew "socat"
brew "speedtest-cli"
brew "starship"
brew "stow"
brew "swagger-codegen"
brew "the_silver_searcher"
brew "thefuck"
brew "tldr"
brew "typst"
brew "uv"
brew "wget"
brew "yamllint"
brew "ykman"
brew "ykpers"
brew "yt-dlp"
brew "zx"
brew "gocardless/taps/cli"
brew "hashicorp/tap/vlt"
brew "hookdeck/hookdeck/hookdeck"
brew "oven-sh/bun/bun"
brew "puma/puma/puma-dev"
brew "qmk/qmk/qmk"
brew "stripe/stripe-cli/stripe"
brew "supabase/tap/supabase"
cask "1password"
cask "1password-cli"
cask "adobe-acrobat-reader"
cask "anki"
cask "arc"
cask "arq"
cask "autodesk-fusion"
cask "beeper"
cask "betterdisplay"
cask "camo-studio"
cask "cf-terraforming"
cask "cheatsheet"
cask "cursor"
cask "dash"
cask "db-browser-for-sqlite"
cask "devutils"
cask "discord"
cask "dropbox"
cask "firefox"
cask "font-fira-code"
cask "font-hack-nerd-font"
cask "ghostty"
cask "gitbutler"
cask "google-chrome"
cask "grammarly-desktop"
cask "jetbrains-toolbox"
cask "kopiaui"
cask "notion"
cask "obsidian"
cask "postman"
cask "prusaslicer"
cask "qmk-toolbox"
cask "raycast"
cask "rectangle"
cask "slack"
cask "spotify"
cask "todoist-app"
cask "transmission"
cask "visual-studio-code"
cask "vlc"
cask "wacom-tablet"
cask "xquartz"
cask "zed"
cask "zoom"
mas "Final Cut Pro", id: 424389933
mas "keymapp", id: 6472865291
mas "reMarkable", id: 1276493162
mas "Tailscale", id: 1475387142
vscode "alefragnani.project-manager"
vscode "anthropic.claude-code"
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bierner.markdown-yaml-preamble"
vscode "bradlc.vscode-tailwindcss"
vscode "castwide.solargraph"
vscode "codezombiech.gitignore"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.git-extension-pack"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "juanblanco.solidity"
vscode "mechatroner.rainbow-csv"
vscode "mgmcdermott.vscode-language-babel"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.azure-account"
vscode "ms-vsliveshare.vsliveshare"
vscode "rebornix.ruby"
vscode "redhat.vscode-yaml"
vscode "saoudrizwan.claude-dev"
vscode "shopify.ruby-lsp"
vscode "streetsidesoftware.code-spell-checker"
vscode "supermaven.supermaven"
vscode "tldraw-org.tldraw-vscode"
vscode "wingrunr21.vscode-ruby"
vscode "ziyasal.vscode-open-in-github"
go "filippo.io/age/cmd/age"
go "filippo.io/age/cmd/age-keygen"
go "github.com/spf13/cobra-cli"
go "github.com/go-delve/delve/cmd/dlv"
go "github.com/kisielk/errcheck"
go "github.com/kisielk/godepgraph"
go "golang.org/x/tools/cmd/godoc"
go "golang.org/x/tools/cmd/goimports"
go "github.com/golangci/golangci-lint/cmd/golangci-lint"
go "golang.org/x/tools/gopls"
go "maelstrom-echo"
go "maelstrom-unique-ids"
go "honnef.co/go/tools/cmd/staticcheck"
go "github.com/drand/tlock/cmd/tle"
go "github.com/writefreely/writefreely/cmd/writefreely"
