tap "cloudflare/cloudflare"
tap "derailed/k9s"
tap "espanso/espanso"
tap "fluxcd/tap"
tap "gromgit/fuse"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "hookdeck/hookdeck"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "oven-sh/bun"
tap "qmk/qmk"
tap "stripe/stripe-cli"
tap "supabase/tap"
tap "twilio/brew"
brew "act"
brew "antigen"
brew "zstd"
brew "openssl@3"
brew "cmake"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "colima", restart_service: true
brew "coreutils"
brew "deno"
brew "direnv"
brew "docker"
brew "exercism"
brew "sdl2"
brew "ffmpeg"
brew "flyctl"
brew "fzf"
brew "gh"
brew "ghostscript"
brew "git-absorb"
brew "git-lfs"
brew "gnu-getopt"
brew "gnupg"
brew "go"
brew "graphviz"
brew "guile"
brew "hopenpgp-tools"
brew "htop"
brew "jq"
brew "kind"
brew "krb5"
brew "libheif"
brew "libpq"
brew "llvm@17"
brew "macos-trash"
brew "mas"
brew "protobuf"
brew "mosh"
brew "neovim"
brew "node"
brew "openjdk"
brew "pam-reattach"
brew "php"
brew "pinentry-mac"
brew "pipenv"
brew "poppler"
brew "python@3.10"
brew "ruby-build"
brew "rbenv"
brew "ripgrep"
brew "rust"
brew "rustup-init"
brew "sccache"
brew "socat"
brew "starship"
brew "stow"
brew "the_silver_searcher"
brew "thefuck"
brew "tldr"
brew "typst"
brew "uv"
brew "wget"
brew "yamllint"
brew "yarn"
brew "ykman"
brew "ykpers"
brew "zx"
brew "hashicorp/tap/vlt"
brew "hookdeck/hookdeck/hookdeck"
brew "oven-sh/bun/bun"
brew "qmk/qmk/qmk"
brew "stripe/stripe-cli/stripe"
brew "supabase/tap/supabase"
cask "1password"
cask "1password-cli"
cask "adobe-acrobat-reader"
cask "anki"
cask "arc"
cask "arq"
cask "beeper"
cask "camo-studio"
cask "cf-terraforming"
cask "cheatsheet"
cask "cold-turkey-blocker"
cask "dash"
cask "devutils"
cask "discord"
cask "dropbox"
cask "espanso"
cask "gitbutler"
cask "google-chrome"
cask "grammarly-desktop"
cask "jetbrains-toolbox"
cask "kitty"
cask "kopiaui"
cask "notion"
cask "obsidian"
cask "postman"
cask "qmk-toolbox"
cask "rectangle"
cask "slack"
cask "spotify"
cask "todoist"
cask "transmission"
cask "visual-studio-code"
cask "vlc"
cask "wacom-tablet"
cask "xquartz"
cask "zed"
cask "zoom"
mas "Sequel Ace", id: 1518036000
mas "Tailscale", id: 1475387142
vscode "alefragnani.project-manager"
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bierner.markdown-yaml-preamble"
vscode "bradlc.vscode-tailwindcss"
vscode "castwide.solargraph"
vscode "codezombiech.gitignore"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.git-extension-pack"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "juanblanco.solidity"
vscode "mechatroner.rainbow-csv"
vscode "mgmcdermott.vscode-language-babel"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.azure-account"
vscode "ms-vsliveshare.vsliveshare"
vscode "rebornix.ruby"
vscode "redhat.vscode-yaml"
vscode "shopify.ruby-lsp"
vscode "streetsidesoftware.code-spell-checker"
vscode "supermaven.supermaven"
vscode "tldraw-org.tldraw-vscode"
vscode "wingrunr21.vscode-ruby"
vscode "ziyasal.vscode-open-in-github"
