# Development tools and languages
tap "cloudflare/cloudflare"
tap "derailed/k9s"
tap "fluxcd/tap"
tap "gocardless/taps"
tap "hashicorp/tap"
tap "hookdeck/hookdeck"
tap "oven-sh/bun"
tap "puma/puma"
tap "qmk/qmk"
tap "stripe/stripe-cli"
tap "supabase/tap"
tap "twilio/brew"
tap "steveyegge/beads"
tap "withgraphite/tap"

# Build dependencies
brew "cmake"
brew "gcc"
brew "llvm"
brew "llvm@17"
brew "openssl@3"
brew "ncurses"
brew "readline"
brew "libffi"
brew "pkgconf"
brew "zstd"

# Languages and runtimes
brew "node"
brew "pnpm"
brew "deno"
brew "oven-sh/bun/bun"
brew "python@3.10"
brew "pipenv"
brew "uv"
brew "ruby-build"
brew "rbenv"
brew "rust"
brew "rustup"
brew "sccache"
brew "php"
brew "openjdk"
brew "openjdk@11"

# Go tools (installed via go install)
go "filippo.io/age/cmd/age"
go "filippo.io/age/cmd/age-keygen"
go "github.com/spf13/cobra-cli"
go "github.com/go-delve/delve/cmd/dlv"
go "github.com/kisielk/errcheck"
go "github.com/kisielk/godepgraph"
go "golang.org/x/tools/cmd/godoc"
go "golang.org/x/tools/cmd/goimports"
go "github.com/golangci/golangci-lint/cmd/golangci-lint"
go "golang.org/x/tools/gopls"
go "honnef.co/go/tools/cmd/staticcheck"

# Docker and K8s
brew "docker"
brew "kind"
brew "act"

# Databases
brew "mysql-client"
brew "mysql-client@8.4"
brew "mysql@8.0"

# Cloud and DevOps
brew "flyctl"
brew "opentofu"
brew "hashicorp/tap/vlt"
brew "gocardless/taps/cli"
brew "hookdeck/hookdeck/hookdeck"

# API tools
brew "protobuf"
brew "swagger-codegen"

# Web dev
brew "puma/puma/puma-dev"
brew "zx"

# QMK (keyboard firmware)
tap "osx-cross/arm"
tap "osx-cross/avr"
brew "qmk/qmk/qmk"

# Media processing
brew "ffmpeg"
brew "jpeg-xl"
brew "libheif"
brew "harfbuzz"
brew "sdl2"
brew "tesseract"
brew "ghostscript"
brew "poppler"
brew "pillow"
brew "yt-dlp"

# AI and CLI tools
brew "ast-grep"
brew "gemini-cli"
brew "opencode"
brew "steveyegge/beads/bd"

# Other dev tools
brew "gnu-getopt"
brew "guile"
brew "gnuplot"
brew "yamllint"
brew "rclone"
brew "socat"
brew "speedtest-cli"
brew "typst"
brew "exercism"
brew "krb5"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "utf8proc"

# Misc dev builds
go "maelstrom-echo"
go "maelstrom-unique-ids"
go "github.com/drand/tlock/cmd/tle"
go "github.com/writefreely/writefreely/cmd/writefreely"

# VS Code extensions
vscode "alefragnani.project-manager"
vscode "anthropic.claude-code"
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bierner.markdown-yaml-preamble"
vscode "bradlc.vscode-tailwindcss"
vscode "castwide.solargraph"
vscode "codezombiech.gitignore"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.git-extension-pack"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "juanblanco.solidity"
vscode "mechatroner.rainbow-csv"
vscode "mgmcdermott.vscode-language-babel"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.azure-account"
vscode "ms-vsliveshare.vsliveshare"
vscode "rebornix.ruby"
vscode "redhat.vscode-yaml"
vscode "saoudrizwan.claude-dev"
vscode "shopify.ruby-lsp"
vscode "streetsidesoftware.code-spell-checker"
vscode "supermaven.supermaven"
vscode "tldraw-org.tldraw-vscode"
vscode "wingrunr21.vscode-ruby"
vscode "ziyasal.vscode-open-in-github"
