# Development tools and languages
tap "cloudflare/cloudflare"
tap "derailed/k9s"
tap "fluxcd/tap"
tap "gocardless/taps"
tap "hashicorp/tap"
tap "hookdeck/hookdeck"
tap "oven-sh/bun"
tap "puma/puma"
tap "qmk/qmk"
tap "stripe/stripe-cli"
tap "supabase/tap"
tap "twilio/brew"
tap "steveyegge/beads"
tap "withgraphite/tap"

# Build dependencies
brew "cmake"
brew "gcc"
brew "git"
brew "llvm"
brew "openssl@3"
brew "ncurses"
brew "readline"
brew "libffi"
brew "pkgconf"
brew "zstd"

# Languages and runtimes
brew "node"
brew "pnpm"
brew "oven-sh/bun/bun"
brew "python@3.10"
brew "pipenv"
brew "uv"
brew "ruby-build"
brew "rbenv"
brew "rust"
brew "sccache"
brew "openjdk"
brew "openjdk@11"

# Go tools (installed via go install)
go "filippo.io/age/cmd/age"
go "filippo.io/age/cmd/age-keygen"
go "github.com/spf13/cobra-cli"
go "github.com/go-delve/delve/cmd/dlv"
go "github.com/kisielk/errcheck"
go "github.com/kisielk/godepgraph"
go "golang.org/x/tools/cmd/godoc"
go "golang.org/x/tools/cmd/goimports"
go "github.com/golangci/golangci-lint/cmd/golangci-lint"
go "golang.org/x/tools/gopls"
go "honnef.co/go/tools/cmd/staticcheck"

# Docker and K8s
brew "docker"
brew "kind"
brew "act"

# Databases
brew "mysql-client"
brew "mysql@8.0"

# Cloud and DevOps
brew "flyctl"
brew "opentofu"
brew "hashicorp/tap/vlt"
brew "gocardless/taps/cli"
brew "hookdeck/hookdeck/hookdeck"

# API tools
brew "protobuf"
brew "swagger-codegen"

# Web dev
brew "puma/puma/puma-dev"

# QMK (keyboard firmware)
tap "osx-cross/arm"
tap "osx-cross/avr"
brew "qmk/qmk/qmk"

# Media processing
brew "ffmpeg"
brew "jpeg-xl"
brew "libheif"
brew "harfbuzz"
brew "sdl2"
brew "tesseract"
brew "ghostscript"
brew "poppler"
brew "pillow"
brew "yt-dlp"

# AI and CLI tools
brew "ast-grep"
brew "gemini-cli"
brew "opencode"
brew "steveyegge/beads/bd"

# Other dev tools
brew "gnu-getopt"
brew "guile"
brew "gnuplot"
brew "yamllint"
brew "rclone"
brew "socat"
brew "speedtest-cli"
brew "typst"
brew "exercism"
brew "krb5"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "utf8proc"

# Misc dev builds
go "maelstrom-echo"
go "maelstrom-unique-ids"
go "github.com/drand/tlock/cmd/tle"
go "github.com/writefreely/writefreely/cmd/writefreely"
